run/growingDroplet/flowDroplet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1300;
        startFace       2523;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1300;
        startFace       3823;
    }
    left
    {
        type            patch;
        nFaces          25;
        startFace       5123;
    }
    right
    {
        type            patch;
        nFaces          25;
        startFace       5148;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          52;
        startFace       5173;
    }
    bottomRemainder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          52;
        startFace       5225;
    }
)

// ************************************************************************* //
