run/growingDroplet/flowDroplet/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// The topoSetDict comprises a list of actions to perform on different
// set types (cellSet, faceSet, pointSet, etc).
//
// Each action is a dictionary with e.g.
//     // Name of set
//     name    c0;
//
//     // type: pointSet/faceSet/cellSet/faceZoneSet/cellZoneSet
//     type    cellSet;
//
//     // action to perform on set. Two types:
//     // - require no source : clear/invert/remove
//     //       clear  : clears set or zone
//     //       invert : select all currently non-selected elements
//     //       remove : removes set or zone
//     // - require source    : new/add/subtract/subset
//     //       new    : create new set or zone from source
//     //       add    : add source to contents
//     //       subtract : subtract source from contents
//     //       subset : keeps elements both in contents and source
//     action  new;
//
// The source entry varies according to the type of set.
//
// In OpenFOAM 1806 and earlier, it was compulsory to use a 'sourceInfo'
// sub-dictionary to define the sources.
// In OpenFOAM 1812 and later, this sub-directory is optional, unless
// there would be a name clash (Eg, 'type' or 'name' appearing at both levels).
// In most cases, the source definitions have been adjusted to avoid such
// clashes.
//
// More detailed listing in the annotated topoSetSourcesDict

// Set geometric parameters
centreX     0.0025;
centreY     0.0;
radius      0.001;
rFraction   0.1;

actions
(
    // Select the bottom patch on which the droplet is sitting and extract
    // a square set around the droplet centre to use as inlet.
    {
        name    inletFaces;
        type    faceSet;
        action  new;
        source  patchToFace;
        patch   bottom;
    }
    {
        name    inletFaces;
        type    faceSet;
        action  subset;
        source  boxToFace;
        // Assumes the bottom patch lies in the x-y plane with z=0
        // Take a square with edge length 0.2*radius
        min     (#eval{$centreX - $rFraction*$radius}
                 #eval{$centreY - $rFraction*$radius}
                 -100
                );
        max     (#eval{$centreX + $rFraction*$radius}
                 #eval{$centreY + $rFraction*$radius}
                 100
                );
    }

    // Create remainder of bottom patch as set to define an appropriate boundary
    // patch from it.
    {
        name    bottomRemainder;
        type    faceSet;
        action  new;
        source  patchToFace;
        patch   bottom;
    }
    {
        name    bottomRemainder;
        type    faceSet;
        action  subtract;
        source  faceToFace;
        set     inletFaces;
    }
);

// ************************************************************************* //
